Autodesk.Revit.DB.FailureDefinitionId.op_Inequality(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureDefinitionId)
Compares two FailureDefinitionId instances.
first: The first FailureDefinitionId.
second: The second FailureDefinitionId.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.FailureDefinitionId.op_Equality(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureDefinitionId)
Compares two FailureDefinitionId instances.
first: The first FailureDefinitionId.
second: The second FailureDefinitionId.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.FailureDefinitionId.#ctor(System.Guid)
Creates a new FailureDefinitionId instance.
guid: The identifier for the FailureDefinitionId.

Autodesk.Revit.DB.FailureDefinitionId
The unique identifier of a FailureDefinition.
Remarks:
Each possible failure in Revit must be defined and registered during Revit application startup
by creating a FailureDefinition object.
Unique FailureDefinitionId must be used as a key to register FailureDefinition.
Those unique FailureDefinitionId should be created using GUID generation tool.
Later FailureDefinitionId can be used to lookup FailureDefinition
in FailureDefinitionRegistry, and create and post FailureMessages.
Since:
2011